Тест_ЗУП_31_КОРП/src/Enums/ДействияСЕжегоднымиОтпусками/ДействияСЕжегоднымиОтпусками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДействияСЕжегоднымиОтпусками</name>
  <enumValues>
    <name>Утвердить</name>
  </enumValues>
  <enumValues>
    <name>Отменить</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ВидыОтпусков/ВидыОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОтпусков</name>
  <predefined>
    <items>
      <name>ОтпускПострадавшимВАварииЧАЭС</name>
      <description>Дополнительный отпуск пострадавшим на ЧАЭС</description>
    </items>
    <items>
      <name>ОтпускУчебный</name>
      <description>Дополнительный учебный отпуск (оплачиваемый)</description>
    </items>
    <items>
      <name>ОтпускБезОплатыУчебный</name>
      <description>Дополнительный учебный отпуск без оплаты</description>
    </items>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
    <items>
      <name>ОтпускЗаСвойСчет</name>
      <description>Отпуск без оплаты в соотв. с частью 1 статьи 128 ТК РФ</description>
    </items>
    <items>
      <name>ОтпускБезОплатыПоТКРФ</name>
      <description>Отпуск без оплаты в соотв. с частью 2 статьи 128 ТК РФ</description>
    </items>
    <items>
      <name>ОтпускЗаВредность</name>
      <description>Отпуск за вредность</description>
    </items>
    <items>
      <name>ОтпускЗаВыслугуЛет</name>
      <description>Отпуск за выслугу лет</description>
    </items>
    <items>
      <name>ОтпускЗаВыслугуЛетНаГосударственнойСлужбе</name>
      <description>Отпуск за выслугу лет на государственной службе</description>
    </items>
    <items>
      <name>ОтпускНаСанаторноКурортноеЛечение</name>
      <description>Отпуск на период санаторно-курортного лечения (за счет ФСС)</description>
    </items>
    <items>
      <name>Северный</name>
      <description>Северный</description>
    </items>
  </predefined>
  <attributes>
    <name>ОтпускЯвляетсяЕжегодным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаОтпуска</name>
    <type>
      <types>EnumRef.СпособыРасчетаОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставлятьОтпускВсемСотрудникам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускБезОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НакопительныйОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерЗависимостиДнейОтпуска</name>
    <type>
      <types>EnumRef.ХарактерЗависимостиКоличестваДнейОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажа</name>
    <type>
      <types>CatalogRef.ВидыСтажа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШкалаОценкиСтажа</name>
    <attributes>
      <name>ВерхняяГраницаИнтервалаСтажа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейВГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/CommonModules/ОстаткиОтпусковКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПОДСИСТЕМА ОСТАТКИ ОТПУСКОВ
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПриАктивизацииСтрокиЕжегодногоОтпуска(Форма, ФиксирующиеРеквизиты = "ДействующийОтпуск") Экспорт
	
	ДанныеТекущейСтроки = Форма.Элементы.ЕжегодныеОтпуска.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеТекущейСтроки.Действие = ПредопределенноеЗначение("Перечисление.ДействияСЕжегоднымиОтпусками.Утвердить") Или (Не СтрокаЗафиксирована(ДанныеТекущейСтроки, ФиксирующиеРеквизиты)) Тогда
		Форма.Элементы.ЕжегодныеОтпускаВидЕжегодногоОтпуска.ТолькоПросмотр = Ложь;
	Иначе
		Форма.Элементы.ЕжегодныеОтпускаВидЕжегодногоОтпуска.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УстановитьТекущуюСтраницуКоманднойПанели(Форма, ДанныеТекущейСтроки, ФиксирующиеРеквизиты);
	
КонецПроцедуры

Процедура ПередНачаломДобавленияЕжегодногоОтпуска(Форма, Отказ) Экспорт
	
	Если Форма.Элементы.Позиции.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНачалеРедактированияЕжегодногоОтпуска(Форма, ТекущиеДанные, НоваяСтрока) Экспорт
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		ТекущийОбъект = Форма.Объект;
	Иначе
		ТекущийОбъект = Форма;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСЕжегоднымиОтпусками.Утвердить");
		Если ТекущийОбъект.ЕжегодныеОтпуска.Количество() = 1 Тогда
			ТекущиеДанные.ВидЕжегодногоОтпуска = ПредопределенноеЗначение("Справочник.ВидыОтпусков.Основной");
			ПриИзмененииВидаЕжегодногоОтпуска(Форма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОкончанииРедактированияЕжегодногоОтпуска(ТекущиеДанные, УстановитьУтвердить) Экспорт
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОстаткиОтпусковКлиентСервер.УстановитьКомментарииДействийСЕжегоднымОтпуском(ТекущиеДанные);
	
КонецПроцедуры
 
Процедура ПередУдалениемЕжегодногоОтпуска(Форма, Отказ, ФиксирующиеРеквизиты = "ДействующийОтпуск", ЕстьТабличнаяЧастьОстатков = Ложь) Экспорт
	
	Отказ = Истина;
	
	ДанныеТекущейСтроки	= Форма.Элементы.ЕжегодныеОтпуска.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		ТекущийОбъект = Форма.Объект;
	Иначе
		ТекущийОбъект = Форма;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
	Если СтрокаЗафиксирована(ДанныеТекущейСтроки, ФиксирующиеРеквизиты) Тогда 
		Если ДанныеТекущейСтроки.Действие = ПредопределенноеЗначение("Перечисление.ДействияСЕжегоднымиОтпусками.Отменить") Тогда
			ВключитьПредоставлениеОтпуска(Форма, ДанныеТекущейСтроки, ФиксирующиеРеквизиты)
		Иначе
			ВыключитьПредоставлениеОтпуска(Форма, ДанныеТекущейСтроки, ФиксирующиеРеквизиты)
		КонецЕсли;
		ОстаткиОтпусковКлиентСервер.УстановитьКомментарииДействийСЕжегоднымОтпуском(ДанныеТекущейСтроки);
	Иначе	
		Если ЕстьТабличнаяЧастьОстатков Тогда
			ОстаткиОтпусковКлиент.ОчиститьОстаткиОтпусковПоВидуОтпуска(ТекущийОбъект.ОстаткиОтпусковПоРабочимГодам, ДанныеТекущейСтроки.ВидЕжегодногоОтпуска);
		КонецЕсли;
		ТекущийОбъект.ЕжегодныеОтпуска.Удалить(ТекущийОбъект.ЕжегодныеОтпуска.Индекс(ДанныеТекущейСтроки));
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриИзмененииВидаЕжегодногоОтпуска(Форма) Экспорт
	
	ДанныеСтроки = Форма.Элементы.ЕжегодныеОтпуска.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Или ДанныеСтроки.ВидЕжегодногоОтпуска.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоДнейВГод = ОстаткиОтпусковВызовСервера.КоличествоДнейОтпускаВГодПоУмолчанию(ДанныеСтроки.ВидЕжегодногоОтпуска);
	Если КоличествоДнейВГод <> Неопределено Тогда
		ДанныеСтроки.КоличествоДнейВГод = КоличествоДнейВГод;
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеКоманднойПанелиЕжегодныхОтпусков()
	
	ОписаниеКоманднойПанели = Новый Структура("СтраницыКоманднойПанели,СтраницаДобавитьОтменить,СтраницаДобавитьПродолжить,СтраницаДобавитьУдалить");
	ОписаниеКоманднойПанели.СтраницыКоманднойПанели		= "СтраницыКоманднойПанелиЕО";
	ОписаниеКоманднойПанели.СтраницаДобавитьОтменить	= "СтраницаДобавитьОтменитьЕО";
	ОписаниеКоманднойПанели.СтраницаДобавитьПродолжить	= "СтраницаДобавитьПродолжитьЕО";
	ОписаниеКоманднойПанели.СтраницаДобавитьУдалить		= "СтраницаДобавитьУдалитьЕО";
	
	Возврат ОписаниеКоманднойПанели;
	
КонецФункции

Процедура УстановитьТекущуюСтраницуКоманднойПанели(Форма, ДанныеТекущейСтроки, ФиксирующиеРеквизиты)
	
	ОписаниеКоманднойПанели = ОписаниеКоманднойПанелиЕжегодныхОтпусков();
	
	Если ДанныеТекущейСтроки.Действие = ПредопределенноеЗначение("Перечисление.ДействияСЕжегоднымиОтпусками.Отменить") Тогда
		Форма.Элементы[ОписаниеКоманднойПанели.СтраницыКоманднойПанели].ТекущаяСтраница = Форма.Элементы[ОписаниеКоманднойПанели.СтраницаДобавитьПродолжить];
		
	Иначе
		Если СтрокаЗафиксирована(ДанныеТекущейСтроки, ФиксирующиеРеквизиты) Тогда
			Форма.Элементы[ОписаниеКоманднойПанели.СтраницыКоманднойПанели].ТекущаяСтраница = Форма.Элементы[ОписаниеКоманднойПанели.СтраницаДобавитьОтменить];
			
		Иначе
			Форма.Элементы[ОписаниеКоманднойПанели.СтраницыКоманднойПанели].ТекущаяСтраница = Форма.Элементы[ОписаниеКоманднойПанели.СтраницаДобавитьУдалить];
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область РаботаСФормамиВводаОстатков

Функция СуществуетГодовойОстаток(ОстаткиОтпусковПоРабочимГодам, ВидЕжегодногоОтпуска) Экспорт

	Существует = Ложь;
	
	Для каждого Остаток Из ОстаткиОтпусковПоРабочимГодам Цикл
		Если Остаток.ВидЕжегодногоОтпуска = ВидЕжегодногоОтпуска Тогда
			Существует = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла; 

	Возврат Существует;
	
КонецФункции

Процедура ОчиститьОстаткиОтпусковПоВидуОтпуска(ОстаткиОтпусковПоРабочимГодам, ВидОтпуска) Экспорт

	МассивУдаляемыхСтрок = ОстаткиОтпусковПоРабочимГодам.НайтиСтроки(Новый Структура("ВидЕжегодногоОтпуска", ВидОтпуска));
	
	Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
		ОстаткиОтпусковПоРабочимГодам.Удалить(УдаляемаяСтрока);
	КонецЦикла; 

КонецПроцедуры

Процедура ПриИзмененииЕжегодныеОтпускаКоличество(Форма, ТекущиеДанные, ФиксирующиеРеквизиты) Экспорт

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.КоличествоДнейВГод > 0
		И ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСЕжегоднымиОтпусками.Отменить") Тогда
	
		ВключитьПредоставлениеОтпуска(Форма, ТекущиеДанные, ФиксирующиеРеквизиты)
	
	КонецЕсли;

	ОстаткиОтпусковКлиентСервер.УстановитьКомментарииДействийСЕжегоднымОтпуском(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

Функция СтрокаЗафиксирована(ТекущаяСтрока, ФиксирующиеРеквизиты)
	
	МассивФиксирующихРеквизитов = СтрРазделить(ФиксирующиеРеквизиты, ",", Ложь);
	
	Для каждого ИмяФиксирующегоРеквизита Из МассивФиксирующихРеквизитов Цикл
		ИмяРеквизита = СтрЗаменить(ИмяФиксирующегоРеквизита, " ", "");
		Если ТекущаяСтрока[ИмяРеквизита] Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоДействующийОтпуск(ТекущиеДанные)

	ДействующийОтпуск = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ДействующийОтпуск");
	
	Если ДействующийОтпуск Тогда
		ДействующийОтпуск = ТекущиеДанные["ДействующийОтпуск"];
	КонецЕсли;
	
	Возврат ДействующийОтпуск;

КонецФункции

Процедура ВключитьПредоставлениеОтпуска(Форма, ДанныеТекущейСтроки, ФиксирующиеРеквизиты)

	Если ЭтоДействующийОтпуск(ДанныеТекущейСтроки) Тогда
		ДанныеТекущейСтроки.Действие = ПредопределенноеЗначение("Перечисление.ДействияСЕжегоднымиОтпусками.ПустаяСсылка");
	Иначе
		ДанныеТекущейСтроки.Действие = ПредопределенноеЗначение("Перечисление.ДействияСЕжегоднымиОтпусками.Утвердить");
	КонецЕсли;
	
	УстановитьТекущуюСтраницуКоманднойПанели(Форма, ДанныеТекущейСтроки, ФиксирующиеРеквизиты);

КонецПроцедуры

Процедура ВыключитьПредоставлениеОтпуска(Форма, ДанныеТекущейСтроки, ФиксирующиеРеквизиты)
	
	ДанныеТекущейСтроки.Действие = ПредопределенноеЗначение("Перечисление.ДействияСЕжегоднымиОтпусками.Отменить");
	Если НЕ ЭтоДействующийОтпуск(ДанныеТекущейСтроки) Тогда
		ДанныеТекущейСтроки.КоличествоДнейВГод = 0;
	КонецЕсли;
	
	УстановитьТекущуюСтраницуКоманднойПанели(Форма, ДанныеТекущейСтроки, ФиксирующиеРеквизиты);
	
КонецПроцедуры

Процедура ОткрытьФормуРедактированияСтажаОтпускаСотрудника(Форма, Сотрудник, ДатаСведений, ВидОтпуска) Экспорт
	
	ВидСтажа = ОстаткиОтпусковВызовСервера.ВидСтажаОтпуска(ВидОтпуска);
	
	КадровыйУчетРасширенныйКлиент.ОткрытьФормуРедактированияСтажейСотрудника(
		Форма, Сотрудник, ДатаСведений, Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидСтажа)));
	
КонецПроцедуры

#КонецОбласти
